package com.lessons.lesson12.homeworks

/*
Реши задачи подходящим методом для работы с коллекцией.
Для каждой задачи есть свой метод, не повторяйся. Список методов в рекомендациях под заданиями.
*/

fun main() {
    val example = listOf(1, 1, 2, 3, 4, 4, 5, 5, 6, 7, 8, 8)
    val string = listOf("kotlin", "Hello", "World", null)


// Задачи на приведение коллекции к значению

// 1. Проверить, что размер коллекции больше 5 элементов.
    println(example.size > 5)

// 2. Проверить, что коллекция пустая
    println(example.isEmpty())

// 3. Проверить, что коллекция не пустая.
    println(example.isNotEmpty())

// 4. Взять элемент по индексу или создать значение если индекса не существует
    println(example.getOrElse(4) { 12 })

// 5. Собрать коллекцию в строку
    println(example.joinToString())

// 6. Посчитать сумму всех значений
    println(example.sum())

// 7. Посчитать среднее
    println(example.average())

// 8. Взять максимальное число
    println(example.maxOrNull())

// 9. Взять минимальное число
    println(example.minOrNull())

// 10. Взять первое число или null
    println(example.firstOrNull())

// 11. Проверить что коллекция содержит элемент
    println(example.contains(56))

    /*
Реши задачи подходящим методом для работы с коллекцией.
Для каждой задачи есть свой метод, не повторяйся. Список методов в рекомендациях под заданиями.
*/

// Задачи на обработку коллекций

// 12. Отфильтровать коллекцию по диапазону 18-30
    println(example.filter { it in 18..30 })

// 13. Выбрать числа, которые не делятся на 2 и 3 одновременно
    println(example.filterNot { it % 6 == 0 })

// 14. Очистить текстовую коллекцию от null элементов
    println(string.filterNotNull())

// 15. Преобразовать текстовую коллекцию в коллекцию длин слов
     println(string.map { it?.length })

// 16. Преобразовать текстовую коллекцию в мапу, где ключи - перевёрнутые слова, а значения - длина слов
    println(string.filterNotNull().associate { it.reversed() to it.length })

// 17. Отсортировать список в алфавитном порядке
    println(string.filterNotNull().sorted())

// 18. Взять первые 3 элемента списка
    println(example.take(3))

// 19. Распечатать квадраты элементов списка
    example.forEach { println(it * it) }

// 20. Группировать список по первой букве слов
    println(string.filterNotNull().groupBy { it[0] })

// 21. Очистить список от дублей
    println(example.distinct())

// 22. Отсортировать список по убыванию
    println(example.sortedDescending())

// 23. Взять последние 3 элемента списка
    println(example.takeLast(3))


    /*
Задача 24. Характеристика числовой коллекции.
Напиши функцию, которая принимает коллекцию чисел и возвращает строку
с характеристикой коллекции используя конструкцию when
*/

// Если коллекция пустая - “Пусто”
// Если количество элементов меньше пяти - “Короткая”
// Если коллекция начинается с 0 - “Стартовая”
// Если сумма всех чисел больше 10000 - “Массивная”
// Если среднее значение равно 10 - “Сбалансированная”
// Если длина строки образованная склеиванием коллекции в строку равна 20 - “Клейкая”
// Если максимальное число меньше -10 - “Отрицательная”
// Если минимальное число больше 1000 - “Положительная”
// Если содержит одновременно числа 3 и 14 - “Пи***тая”
// Иначе - “Уникальная”

// Вызвать метод с данными, подходящими под каждую из веток

    fun collection(numbers: List<Int>): String {
        return when {
            numbers.isEmpty() -> "Пусто"
            numbers.size < 5 -> "Короткая"
            numbers.first() == 0 -> "Стартовая"
            numbers.sum() > 10000 -> "Массивная"
            numbers.average() == 10.0 -> "Сбалансированная"
            numbers.joinToString("").length == 20 -> "Клейкая"
            numbers.maxOrNull()!! < -10 -> "Отрицательная"
            numbers.minOrNull()!! > 1000 -> "Положительная"
            numbers.contains(3) && numbers.contains(14) -> "Пи***тая"
            else -> "Уникальная"
        }
    }

    println(collection(listOf()))
    println(collection(listOf(1, 2, 3)))
    println(collection(listOf(0, 5, 6, 7, 8)))
    println(collection(listOf(5000, 6000)))
    println(collection(listOf(10, 10, 10, 10, 10)))
    println(collection(listOf(123456789, 123456789)))
    println(collection(listOf(-20, -15, -11, -30, -12)))
    println(collection(listOf(1001, 2000, 3000, 4000, 5000)))
    println(collection(listOf(3, 14, 20, 30, 40)))
    println(collection(listOf(1, 2, 3, 4, 5)))


    /*
Задача 25. Анализ учебных оценок.
Напиши функцию, которая принимает список чисел и возвращает список чисел.

Пример данных: val grades = listOf(85, 58, 90, 74, 88, 67, 95, 92, 50, 42, 12)

Цель: Отфильтровать удовлетворительные оценки (>=60), отсортировать оставшиеся по возрастанию и взять первые 3.
Вызывай методы обработки и фильтрации последовательно один из другого, чтобы результат предыдущего метода
являлся основой для следующего.
*/
    val grades = listOf(85, 58, 90, 74, 88, 67, 95, 92, 50, 42, 12)

    fun topGrades(grades: List<Int>): List<Int> {
        return grades
            .filter { it >= 60 }
            .sorted()
            .take(3)
    }
    println(topGrades(grades))


/*
Задача 26. Создание каталога по первой букве.
Напиши функцию, которая принимает список строк и возвращает словарь с ключом - буквой и значением - списком строк.

Начальные значения: val list = listOf("Стол", "табурет", "ваза", "Кружка", "Зеркало", "ковер", "Шкаф", "часы", "Люстра",
"подушка", "Картина", "столик", "Вазон", "шторы", "Пуф", "книга", "Фоторамка", "светильник", "Коврик", "вешалка", "Подставка",
"телевизор", "Комод", "полка", "Абажур", "диван", "Кресло", "занавеска", "Бра", "пепельница", "Глобус", "статуэтка", "Поднос", "фигурка",
"Ключница", "плед", "Тумба", "игрушка", "Настенные часы", "подсвечник", "Журнальный столик", "сувенир", "Корзина для белья", "посуда",
"Настольная лампа", "торшер", "Этажерка")

Цель: Привести все слова в списке к нижнему регистру, сгруппировать в каталог по первой букве используя метод groupBy
*/
    val list = listOf("Стол", "табурет", "ваза", "Кружка", "Зеркало", "ковер", "Шкаф", "часы", "Люстра", "подушка", "Картина", "столик", "Вазон", "шторы", "Пуф", "книга", "Фоторамка", "светильник", "Коврик", "вешалка", "Подставка",
"телевизор", "Комод", "полка", "Абажур", "диван", "Кресло", "занавеска", "Бра", "пепельница", "Глобус", "статуэтка", "Поднос", "фигурка",
"Ключница", "плед", "Тумба", "игрушка", "Настенные часы", "подсвечник", "Журнальный столик", "сувенир", "Корзина для белья", "посуда",
"Настольная лампа", "торшер", "Этажерка")

    fun catalog(words: List<String>): Map<Char, List<String>> {
    return words
        .map { it.lowercase() }
        .groupBy { it[0] }
    }
    println(catalog(list))


/*
Задание 27. Подсчёт средней длины слов в списке.
Напиши функцию, которая принимает список строк и возвращает строку.

Начальные значения взять из предыдущей задачи.

Цель: Перевести все слова в количество букв, подсчитать среднее значение.
Вернуть форматированный текст с двумя знаками после запятой, используя функцию format и подходящий шаблон.
 */
    fun averageLength(strings: List<String>): String {
    val average = strings
        .map { it.length }
        .average()
    return "%.2f".format(average)
}
    println(averageLength(list))

/*
Задание 28: Категоризация чисел.
Напиши функцию, которая принимает список чисел и возвращает словарь с ключами - строками и значениями - список чисел.

Начальные значения: val numbers = listOf(1, 3, 5, 7, 3, 1, 8, 9, 9, 7)

Цель: Отобрать уникальные числа, отсортировать по убыванию и сгруппировать по четности (“четные” и “нечетные”).
*/
val numbers = listOf(1, 3, 5, 7, 3, 1, 8, 9, 9, 7)
fun category(num: List<Int>): Map<String,List<Int>> {
    return num
        .distinct()
        .sortedDescending()
        .groupBy { if (it % 2 == 0) "четные" else "нечетные" }
}
    println(category(numbers))


/*
Задание 29: Поиск первого подходящего элемента.
Напиши функцию, которая принимает список чисел и число и возвращает nullable число.

Начальные значения: val ages = listOf(22, 18, 30, 45, 17, null, 60) и число для проверки возраста, например 18.

Цель: Найти первый возраст в списке, который соответствует условию (больше второго аргумента) и вернуть его, либо null если значения не нашлось.
*/
val ages = listOf(22, 18, 30, 45, 17, null, 60)
    fun search(ages: List<Int?>, age: Int): Int? {
        return ages
            .filterNotNull()
            .firstOrNull { it > age }
    }
println(search(ages, 18))
}
