//package com.lessons.lesson05
//
///*
//Операторы в Kotlin используются для выполнения операций над переменными и значениями.
//Они являются фундаментальными элементами языка и позволяют выполнять различные математические,
//логические и другие операции.
//*/
//
//// Арифметические операторы используются для выполнения основных математических операций.
//
//Сложение ( + ) : Складывает два значения.
//
//Вычитание ( - ) : Вычитает одно значение из другого.
//
//Умножение ( * ): Умножает два значения.
//
//Деление ( / ): Делит одно значение на другое.
//
//Остаток от деления ( % ): Возвращает остаток от деления.
//
//val sum = 10 + 5 // 15
//val diff = 10 - 5 // 5
//val product = 10 * 5 // 50
//val quotient = 10 / 5 // 2
//val remainder = 10 % 5 // 0
//val remainder1 = 10 % 6 // 4
//val remainder2 = 10 % 4 // 2

//
//порядок выполнения логических операторов
//1. ! - НЕ
//2. && - И
//3.|| - ИЛИ